shanemmattner/embedded-agent-bridge/examples/esp32c6-test-firmware/sdkconfig.defaults
# Minimal config for ESP32-C6
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
